renzenicolai/esp8266-firmware/user/cgi.c
#include <esp8266.h>

HttpdBuiltInUrl builtInUrls[] = {
  {"*", cgiRedirectApClientToHostname, "wifiswitch"},
  {"/", cgiRedirect, "/home"},
  {"/*", authBasicRn, NULL},
  {"/home", cgiEspFsTemplate, tplHomepage},
  {"/output", cgiSetOutput, NULL},
  {"/pwmset", cgiSetPwm, NULL},
  {"/WS2812set", cgiSetWS2812, NULL},
  {"/settings", cgiEspFsTemplate, tplSettings},
  {"/settings/store", cgiSettingsStore, NULL},

  {"/wifi", cgiEspFsTemplate, tplWifiSettings},
  {"/wifi/store", cgiWifiSettingsStore, NULL},
  {"/wifi/scan", cgiWiFiScan, NULL},
  {"/wifi/status", cgiWiFiStatus, NULL},
  {"/wb", cgiWb, NULL},
  {"/sensor", cgiSensor, NULL},
  {"/input", cgiGetInput, NULL},
  {"/output/state", cgiGetOutput, NULL},

  //{"/flash/download", cgiReadFlash, NULL},
  //{"/flash/next", cgiGetFirmwareNext, &uploadParams},
  //{"/flash/upload", cgiUploadFirmware, &uploadParams},
  //{"/flash/reboot", cgiRebootFirmware, NULL},
  //{"/websocket/ws.cgi", cgiWebsocket, myWebsocketConnect},
  {"*", cgiEspFsHook, NULL}, //Catch-all cgi function for the filesystem
  {NULL, NULL, NULL}
};

HttpdBuiltInUrl* cgi_get_builtInUrls( void )
{
  return builtInUrls;
}

//WiFi access point data
typedef struct {
  char ssid[32];
  char rssi;
  char enc;
} ApData;

//Scan result
typedef struct {
  char scanInProgress; //if 1, don't access the underlying stuff from the webpage.
  ApData **apData;
  int noAps;
} ScanResultData;

//Static scan status storage.
static ScanResultData cgiWifiAps;

#define CONNTRY_IDLE 0
#define CONNTRY_WORKING 1
#define CONNTRY_SUCCESS 2
#define CONNTRY_FAIL 3

//Callback the code calls when a wlan ap scan is done. Basically stores the result in
//the cgiWifiAps struct.
void ICACHE_FLASH_ATTR wifiScanDoneCb(void *arg, STATUS status)
{
  int n;
  struct bss_info *bss_link = (struct bss_info *)arg;
  //os_printf("wifiScanDoneCb %d\n", status);
  if (status!=OK) {
    cgiWifiAps.scanInProgress=0;
    return;
  }
  //Clear prev ap data if needed.
  if (cgiWifiAps.apData!=NULL) {
  for (n=0; n<cgiWifiAps.noAps; n++) os_free(cgiWifiAps.apData[n]);
    os_free(cgiWifiAps.apData);
  }

  //Count amount of access points found.
  n=0;
  while (bss_link != NULL) {
    bss_link = bss_link->next.stqe_next;
    n++;
  }

  //Allocate memory for access point data
  cgiWifiAps.apData=(ApData **)os_malloc(sizeof(ApData *)*n);
  cgiWifiAps.noAps=n;
  os_printf("Scan done: found %d APs\n", n);
  //Copy access point data to the static struct
  n=0;
  bss_link = (struct bss_info *)arg;
  while (bss_link != NULL) {
    if (n>=cgiWifiAps.noAps) {
      //This means the bss_link changed under our nose. Shouldn't happen!
      //Break because otherwise we will write in unallocated memory.
      os_printf("Huh? I have more than the allocated %d aps!\n", cgiWifiAps.noAps);
      break;
    }
    //Save the ap data.
    cgiWifiAps.apData[n]=(ApData *)os_malloc(sizeof(ApData));
    cgiWifiAps.apData[n]->rssi=bss_link->rssi;
    cgiWifiAps.apData[n]->enc=bss_link->authmode;
    strncpy(cgiWifiAps.apData[n]->ssid, (char*)bss_link->ssid, 32);

    bss_link = bss_link->next.stqe_next;
    n++;
  }
  //We're done.
  cgiWifiAps.scanInProgress=0;
}

//Routine to start a WiFi access point scan.
static void ICACHE_FLASH_ATTR wifiStartScan()
{
  if (cgiWifiAps.scanInProgress) return;
  cgiWifiAps.scanInProgress=1;
  wifi_station_scan(NULL, wifiScanDoneCb);
}

//------------------------------------------

int ICACHE_FLASH_ATTR cgiWiFiScan(HttpdConnData *connData)
{
  int pos=(int)connData->cgiData;
  int len;
  char buff[1024];

  if (!cgiWifiAps.scanInProgress && pos!=0) {
    //Fill in json code for an access point
    if (pos-1<cgiWifiAps.noAps) {
      len=os_sprintf(buff, "{\"essid\": \"%s\", \"rssi\": \"%d\", \"enc\": \"%d\"}%s\n",
          cgiWifiAps.apData[pos-1]->ssid, cgiWifiAps.apData[pos-1]->rssi,
          cgiWifiAps.apData[pos-1]->enc, (pos-1==cgiWifiAps.noAps-1)?"":",");
      httpdSend(connData, buff, len);
    }
    pos++;
    if ((pos-1)>=cgiWifiAps.noAps) {
      len=os_sprintf(buff, "]\n}\n}\n");
      httpdSend(connData, buff, len);
      //Also start a new scan.
      wifiStartScan();
      return HTTPD_CGI_DONE;
    } else {
      connData->cgiData=(void*)pos;
      return HTTPD_CGI_MORE;
    }
  }

  httpdStartResponse(connData, 200);
  httpdHeader(connData, "Content-Type", "text/json");
  httpdEndHeaders(connData);

  if (cgiWifiAps.scanInProgress==1) {
    //We're still scanning. Tell Javascript code that.
    len=os_sprintf(buff, "{\n \"result\": { \n\"inProgress\": \"1\"\n }\n}\n");
    httpdSend(connData, buff, len);
    return HTTPD_CGI_DONE;
  } else {
    //We have a scan result. Pass it on.
    len=os_sprintf(buff, "{\n \"result\": { \n\"inProgress\": \"0\", \n\"APs\": [\n");
    httpdSend(connData, buff, len);
    if (cgiWifiAps.apData==NULL) cgiWifiAps.noAps=0;
    connData->cgiData=(void *)1;
    return HTTPD_CGI_MORE;
  }
}

char temperatureString[10] = "Unknown";
char pressureString[10] = "Unknown";

char* ICACHE_FLASH_ATTR updateSensorStrings ( void )
{
  int temperature = board_sensorGetTemperature();
  if (temperature!=-200)
  {
    uint8_t temperature_a = temperature/10;
    uint8_t temperature_b = temperature - (temperature/10);
    os_sprintf(temperatureString,"%d.%d\n\r", temperature_a, temperature_b );
  }
  int pressure = board_sensorGetAirPressure();
  if (pressure!=-200)
  {
    uint8_t pressure_a = pressure/1000;
    uint8_t pressure_b = pressure - (pressure/1000);
    os_sprintf(pressureString, "%d.%d\n\r", pressure_a, pressure_b );
  }
}

void ICACHE_FLASH_ATTR setLabelString(char* buff, uint8_t item)
{
  userSettings_t* settings = settings_get_pointer();
  if (settings->pka_wb==0) {
    os_sprintf(buff, "Output %d", item);
    return;
  } else if (item==1) {
    os_sprintf(buff, "Window blinds");
    return;
  } else if (item==3) {
    os_sprintf(buff, "Output");
    return;
  }
  os_sprintf(buff, "&nbsp;");
  return;
}

void ICACHE_FLASH_ATTR setSwitchString(char* buff, uint8_t item)
{
  bool normalbutton = false;
  uint32_t pin = 0;
  userSettings_t* settings = settings_get_pointer();
  if (settings->pka_wb==0) {
    if (item==1) pin = OUTPUT1;
    if (item==2) pin = OUTPUT2;
    if (item==3) pin = OUTPUT3;
    normalbutton = true;
  } else {
    if (item==1) {
      if (board_wbMode()==2) {
        if (board_wbState()) {
          os_sprintf(buff, "<a class='button' href='/wb?mode=0'>DOWN</a>");
        } else {
          os_sprintf(buff, "<a class='button' href='/wb?mode=1'>UP</a>");
        }
      } else {
        os_sprintf(buff, "<a class='button' href='/wb?mode=2'>STOP</a>");
      }
      return;
    }
    if (item==2) {
      if (board_wbMode()==2) {
        if (board_wbState()) {
          os_sprintf(buff, "State: up");
        } else {
          os_sprintf(buff, "State: down");
        }
      } else {
        if (board_wbState()) {
          os_sprintf(buff, "State: moving up");
        } else {
          os_sprintf(buff, "State: moving down");
        }
      }
      return;
    }
    if (item==3) {
      switch(settings->pka_wb) {
        case 4:
        case 6:
         pin = OUTPUT1;
         normalbutton = true;
         break;
        case 2:
        case 5:
         pin = OUTPUT2;
         normalbutton = true;
         break;
        case 1:
        case 3:
         pin = OUTPUT3;
         normalbutton = true;
         break;
      }
    }
  }

  if (normalbutton) {
    char text2[4] = "on";
    char text[4] = "OFF";
    if (board_getOutput(pin)) {
      os_sprintf(text, "ON");
      os_sprintf(text2, "off");
    }
    os_sprintf(buff, "<a class='button' href='/output?pin=%d&state=%d'>[%s] Switch %s</a>", pin, !board_getOutput(pin), text, text2);
    return;
  }
  os_sprintf(buff, "&nbsp;");
  return;
}

