renzenicolai/esp8266-firmware/user/cgi.c
//Template code for the homepage
int ICACHE_FLASH_ATTR tplHomepage(HttpdConnData *connData, char *token, void **arg) {
  char buff[512];
  if (token==NULL) return HTTPD_CGI_DONE;

  if (os_strcmp(token, "temperature")==0) {
    updateSensorStrings(); //Called 1st
    os_sprintf(buff, "%s", temperatureString);
  }
  if (os_strcmp(token, "pressure")==0) {
    //updateSensorStrings(); //Called 2nd, update not needed
    os_sprintf(buff, "%s", pressureString);
  }
  if (os_strcmp(token, "hour")==0) {
    updateSensorStrings();
    os_sprintf(buff, "--");
  }
  if (os_strcmp(token, "minute")==0) {
    updateSensorStrings();
    os_sprintf(buff, "--");
  }
  if (os_strcmp(token, "second")==0) {
    updateSensorStrings();
    os_sprintf(buff, "--");
  }
  if (os_strcmp(token, "label1")==0) {
    setLabelString(buff, 1);
  }
  if (os_strcmp(token, "label2")==0) {
    setLabelString(buff, 2);
  }
  if (os_strcmp(token, "label3")==0) {
    setLabelString(buff, 3);
  }
  if (os_strcmp(token, "output1")==0) {
    setSwitchString(buff, 1);
  }
  if (os_strcmp(token, "output2")==0) {
    setSwitchString(buff, 2);
  }
  if (os_strcmp(token, "output3")==0) {
    setSwitchString(buff, 3);
  }
  if (os_strcmp(token, "hidewarning")==0) {
    wifiSettings_t* settings = wifiSettingsGetPointer();
    if (!settings->setupEnabled) {
      os_sprintf(buff, " hidden");
    } else {
      os_sprintf(buff, "");
    }
  }

  if (os_strcmp(token, "hostname")==0) {
    os_memcpy( buff, settings_get_pointer()->name, 32 );
  }
    
  httpdSend(connData, buff, -1);
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiGetInput(HttpdConnData *connData) {
  int len;
  char buff[256];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }
  
  os_sprintf(buff, "ERROR" );
  len=httpdFindArg(connData->post->buff, "pin", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pin", buff, sizeof(buff));
  if (len>0) os_sprintf(buff, "%d", board_getInput(atoi(buff)));
  httpdSend(connData, buff, strlen(buff));
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiGetOutput(HttpdConnData *connData) {
  int len;
  char buff[256];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }
  
  os_sprintf(buff, "ERROR" );
  len=httpdFindArg(connData->post->buff, "pin", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pin", buff, sizeof(buff));
  if (len>0) os_sprintf(buff, "%d", board_getOutput(atoi(buff)));
  httpdSend(connData, buff, strlen(buff));
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiSetOutput(HttpdConnData *connData) {
  int len;
  char buff[1024];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }

  uint32_t pin = 999;
  bool state = false;

  len=httpdFindArg(connData->post->buff, "pin", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pin", buff, sizeof(buff));
  if (len>0) pin=atoi(buff);
  len=httpdFindArg(connData->post->buff, "state", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "state", buff, sizeof(buff));
  if (len>0) state=atoi(buff);

  bool result = board_setOutput(pin, state);

  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }
  else
  {
    httpdRedirect(connData, "home");
    return HTTPD_CGI_DONE;
  }
}

int ICACHE_FLASH_ATTR cgiSetPwm(HttpdConnData *connData) {
  int len;
  char buff[1024];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }

  bool result = false;
  int red = 0;
  int green = 0;
  int blue = 0;

  len=httpdFindArg(connData->post->buff, "color", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "color", buff, sizeof(buff));
  if (len==6) {
    //pin=atoi(buff);
    char rstring[3] = {0};
    char gstring[3] = {0};
    char bstring[3] = {0};
    os_memcpy( rstring, buff, 2 );
    os_memcpy( gstring, buff+2, 2 );
    os_memcpy( bstring, buff+4, 2 );
    red = (int)strtol(rstring, NULL, 16);
    green = (int)strtol(gstring, NULL, 16);
    blue = (int)strtol(bstring, NULL, 16);

    #ifdef PWM_ENABLE
      setPWM(red, green, blue);
      os_printf("PWM SET TO %x,%x,%x\n\r", red, green, blue);
      result = true;
    #endif
  }

  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }
  else
  {
    httpdRedirect(connData, "pwm");
    return HTTPD_CGI_DONE;
  }
}

int ICACHE_FLASH_ATTR cgiSetWS2812(HttpdConnData *connData) {
  int len;
  char buff[1024];

  if (connData->conn==NULL) {
    //Connection aborted. Clean up.
    return HTTPD_CGI_DONE;
  }

  bool result = false;
  int red = 0;
  int green = 0;
  int blue = 0;

  len=httpdFindArg(connData->post->buff, "color", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "color", buff, sizeof(buff));
  if (len==6) {
    //pin=atoi(buff);
    char rstring[3] = {0};
    char gstring[3] = {0};
    char bstring[3] = {0};
    os_memcpy( rstring, buff, 2 );
    os_memcpy( gstring, buff+2, 2 );
    os_memcpy( bstring, buff+4, 2 );
    red = (int)strtol(rstring, NULL, 16);
    green = (int)strtol(gstring, NULL, 16);
    blue = (int)strtol(bstring, NULL, 16);
    uint8_t buffer[64] = {0};
    buffer[0] = green;
    buffer[1] = red;
    buffer[2] = blue;
    //board_setWS2812(buffer, 3);
    //os_printf("WS2812 SET TO %x,%x,%x\n\r", red, green, blue);
    result = true;
  }

