renzenicolai/esp8266-firmware/user/cgi.c
  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }
  else
  {
    httpdRedirect(connData, "ws2812");
    return HTTPD_CGI_DONE;
  }
}


//Template code for the settings page
int ICACHE_FLASH_ATTR tplSettings(HttpdConnData *connData, char *token, void **arg)
{
  char buff[128];
  if (token==NULL) return HTTPD_CGI_DONE;

  if (os_strcmp(token, "hidewarning")==0) {
    wifiSettings_t* settings = wifiSettingsGetPointer();
    if (!settings->setupEnabled) {
      os_sprintf(buff, " hidden");
    } else {
      os_sprintf(buff, "");
    }
  }
  
  userSettings_t* settings = settings_get_pointer();
  if ((os_strcmp(token, "name")==0)||(os_strcmp(token, "hostname")==0)) {
    os_memcpy( buff, settings->name, 32 );
  }
  if (os_strcmp(token, "enable_mdns")==0) {
    if (settings->enable_mdns) {
      os_sprintf(buff, " checked");
    } else {
      os_sprintf(buff, "");
    }
  }
  if (os_strcmp(token, "enable_ntp")==0) {
    if (settings->enable_ntp) {
      os_sprintf(buff, " checked");
    } else {
      os_sprintf(buff, "");
    }
  }
  if (os_strcmp(token, "ntp_server")==0) os_memcpy( buff, settings->ntpserver, 64 );
  if (os_strcmp(token, "timezone")==0) os_sprintf( buff, "%d", settings->timezone );
  if (os_strcmp(token, "ntp_summer")==0) {
    if (settings->enable_summertime) {
      os_sprintf(buff, " checked");
    } else {
      os_sprintf(buff, "");
    }
  }
  if (os_strcmp(token, "bootstate")==0) os_sprintf( buff, "%d", settings->bootstate );
  if (os_strcmp(token, "device_password")==0) os_memcpy( buff, settings->device_password, 64 );
  if (os_strcmp(token, "ledstrip_type")==0) os_sprintf( buff, "%d", settings->ledstrip_type );
  if (os_strcmp(token, "ledstrip_length")==0) os_sprintf( buff, "%d", settings->ledstrip_length );
  if (os_strcmp(token, "bootstate_R")==0) os_sprintf( buff, "%d", settings->bootstate_R );
  if (os_strcmp(token, "bootstate_G")==0) os_sprintf( buff, "%d", settings->bootstate_G );
  if (os_strcmp(token, "bootstate_B")==0) os_sprintf( buff, "%d", settings->bootstate_B );
  if (os_strcmp(token, "pka_wb")==0) os_sprintf( buff, "%d", settings->pka_wb );
  if (os_strcmp(token, "pka_wb_time")==0) os_sprintf( buff, "%d", settings->pka_wb_time );
  httpdSend(connData, buff, -1);
  return HTTPD_CGI_DONE;
}

//Template code for the wifi settings page
int ICACHE_FLASH_ATTR tplWifiSettings(HttpdConnData *connData, char *token, void **arg)
{
  char buff[128];
  if (token==NULL) return HTTPD_CGI_DONE;
  wifiSettings_t* settings = wifiSettingsGetPointer();
  if (settings->setupEnabled) {
    if (os_strcmp(token, "ssid")==0) {
      os_memcpy( buff, settings->ssid, 32 );
    }
    if (os_strcmp(token, "password")==0) {
      os_memcpy( buff, settings->password, 64 );
    }
    if (os_strcmp(token, "enable_dhcp")==0) {
      if (settings->enable_dhcp) {
        os_sprintf(buff, " checked");
      } else {
        os_sprintf(buff, "");
      }
    }
    if (os_strcmp(token, "static_ip_1")==0) os_sprintf(buff, "%d", settings->static_ip_1);
    if (os_strcmp(token, "static_ip_2")==0) os_sprintf(buff, "%d", settings->static_ip_2);
    if (os_strcmp(token, "static_ip_3")==0) os_sprintf(buff, "%d", settings->static_ip_3);
    if (os_strcmp(token, "static_ip_4")==0) os_sprintf(buff, "%d", settings->static_ip_4);
    if (os_strcmp(token, "static_gateway_1")==0) os_sprintf(buff, "%d", settings->static_gateway_1);
    if (os_strcmp(token, "static_gateway_2")==0) os_sprintf(buff, "%d", settings->static_gateway_2);
    if (os_strcmp(token, "static_gateway_3")==0) os_sprintf(buff, "%d", settings->static_gateway_3);
    if (os_strcmp(token, "static_gateway_4")==0) os_sprintf(buff, "%d", settings->static_gateway_4);
    if (os_strcmp(token, "static_netmask_1")==0) os_sprintf(buff, "%d", settings->static_netmask_1);
    if (os_strcmp(token, "static_netmask_2")==0) os_sprintf(buff, "%d", settings->static_netmask_2);
    if (os_strcmp(token, "static_netmask_3")==0) os_sprintf(buff, "%d", settings->static_netmask_3);
    if (os_strcmp(token, "static_netmask_4")==0) os_sprintf(buff, "%d", settings->static_netmask_4);
  } else {
    strcpy(buff, "NOT IN SETUP MODE");
  }
  httpdSend(connData, buff, -1);
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiSettingsStore(HttpdConnData *connData)
{
  int len;
  char buff[1024];
  userSettings_t* settings = settings_get_pointer();
  if (connData->conn==NULL) return HTTPD_CGI_DONE;
  len=httpdFindArg(connData->post->buff, "name", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "name", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->name, buff, 32);
  len=httpdFindArg(connData->post->buff, "enable_mdns", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_mdns", buff, sizeof(buff));
  if (len>0) settings->enable_mdns = atoi(buff);
  len=httpdFindArg(connData->post->buff, "enable_ntp", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_ntp", buff, sizeof(buff));
  if (len>0) settings->enable_ntp = atoi(buff);
  len=httpdFindArg(connData->post->buff, "ntp_server", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ntp_server", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->ntpserver, buff, 64);
  len=httpdFindArg(connData->post->buff, "timezone", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "timezone", buff, sizeof(buff));
  if (len>0) settings->timezone = atoi(buff);
  len=httpdFindArg(connData->post->buff, "enable_summertime", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_summertime", buff, sizeof(buff));
  if (len>0) settings->enable_summertime = atoi(buff);
  len=httpdFindArg(connData->post->buff, "device_password", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "device_password", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->device_password, buff, 64);
  len=httpdFindArg(connData->post->buff, "bootstate", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "bootstate", buff, sizeof(buff));
  if (len>0) settings->bootstate = atoi(buff);
  len=httpdFindArg(connData->post->buff, "ledstrip_type", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ledstrip_type", buff, sizeof(buff));
  if (len>0) settings->ledstrip_type = atoi(buff);
  len=httpdFindArg(connData->post->buff, "ledstrip_length", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ledstrip_length", buff, sizeof(buff));
  if (len>0) settings->ledstrip_length = atoi(buff);
  len=httpdFindArg(connData->post->buff, "bootstate_R", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "bootstate_R", buff, sizeof(buff));
  if (len>0) settings->bootstate_R = atoi(buff);
  len=httpdFindArg(connData->post->buff, "bootstate_G", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "bootstate_G", buff, sizeof(buff));
  if (len>0) settings->bootstate_G = atoi(buff);
  len=httpdFindArg(connData->post->buff, "bootstate_B", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "bootstate_B", buff, sizeof(buff));
  if (len>0) settings->bootstate_B = atoi(buff);
  len=httpdFindArg(connData->post->buff, "pka_wb", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pka_wb", buff, sizeof(buff));
  if (len>0) settings->pka_wb = atoi(buff);
  len=httpdFindArg(connData->post->buff, "pka_wb_time", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "pka_wb_time", buff, sizeof(buff));
  if (len>0) settings->pka_wb_time = atoi(buff); 
  settings_store( settings );
  httpdRedirect(connData, "/settingsstored");
  settings_apply( settings, false );
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiWifiSettingsStore(HttpdConnData *connData)
{
  int len;
  char buff[1024];
  wifiSettings_t* settings = wifiSettingsGetPointer();
  if (connData->conn==NULL) return HTTPD_CGI_DONE;
  len=httpdFindArg(connData->post->buff, "ssid", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ssid", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->ssid, buff, 32);
  len=httpdFindArg(connData->post->buff, "password", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "password", buff, sizeof(buff));
  if (len>0) os_memcpy(settings->password, buff, 64);
  len=httpdFindArg(connData->post->buff, "enable_dhcp", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "enable_dhcp", buff, sizeof(buff));
  if (len>0) settings->enable_dhcp = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_ip_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_1", buff, sizeof(buff));
  if (len>0) settings->static_ip_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_ip_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_2", buff, sizeof(buff));
  if (len>0) settings->static_ip_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_ip_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_3", buff, sizeof(buff));
  if (len>0) settings->static_ip_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_ip_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_ip_4", buff, sizeof(buff));
  if (len>0) settings->static_ip_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_1", buff, sizeof(buff));
  if (len>0) settings->static_gateway_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_2", buff, sizeof(buff));
  if (len>0) settings->static_gateway_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_3", buff, sizeof(buff));
  if (len>0) settings->static_gateway_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_gateway_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_gateway_4", buff, sizeof(buff));
  if (len>0) settings->static_gateway_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_1", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_1", buff, sizeof(buff));
  if (len>0) settings->static_netmask_1 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_2", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_2", buff, sizeof(buff));
  if (len>0) settings->static_netmask_2 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_3", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_3", buff, sizeof(buff));
  if (len>0) settings->static_netmask_3 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "static_netmask_4", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "static_netmask_4", buff, sizeof(buff));
  if (len>0) settings->static_netmask_4 = atoi(buff);
  len=httpdFindArg(connData->post->buff, "force", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "force", buff, sizeof(buff));
  if (len>0) {
    char buff[256];
    os_sprintf(buff, "Settings forcefully applied.<br />To re-enable setup mode please press the setup button on the device.<br />Please reset the device now.");
    httpdSend(connData, buff, strlen(buff));
    settings->setupEnabled = false;
    wifiSettingsWriteToFlash( settings );
    os_printf("APPLIED WIFI SETTINGS WITHOUT CHECK.\n\r");
  } else {
    wifiSetupCommit( settings );
    httpdRedirect(connData, "/wificonntest");
    os_printf("WifiSetupCommit called.\n\r");
  }
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiWiFiStatus(HttpdConnData *connData)
{
  int len;
  char buff[256];
  if (connData->conn==NULL) return HTTPD_CGI_DONE;

  len=httpdFindArg(connData->post->buff, "ip", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ip", buff, sizeof(buff));
  if (len>0) {
    struct ip_info info;
    wifi_get_ip_info( 0x00, &info );
    os_sprintf(buff, IPSTR, IP2STR(&info.ip));
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }

  len=httpdFindArg(connData->post->buff, "ssid", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ssid", buff, sizeof(buff));
  if (len>0) {
    os_sprintf(buff, "%s", wifiSettingsGetPointer()->ssid);
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }

