renzenicolai/esp8266-firmware/user/cgi.c
  len=httpdFindArg(connData->post->buff, "ct", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "ct", buff, sizeof(buff));
  if (len>0) {
    uint8_t ctr = 0; //Not doing anything
    if (wifiGetConnectionTest()) {
      ctr = 1; //testing...
    }
    if (wifiGetConnectionTestEnded()) {
      if (wifiGetConnectionResult()) {
        ctr = 2; //success
      } else {
        ctr = 3; //failed
      }
    }
    os_sprintf(buff, "%d", ctr);
    httpdSend(connData, buff, strlen(buff));
    return HTTPD_CGI_DONE;
  }

  os_sprintf(buff, "%d", wifi_station_get_connect_status());
  httpdSend(connData, buff, strlen(buff));
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiWb(HttpdConnData *connData)
{
  int len;
  bool result = false;
  char buff[1024];
  if (connData->conn==NULL) return HTTPD_CGI_DONE;
  len=httpdFindArg(connData->post->buff, "mode", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "mode", buff, sizeof(buff));
  if (len>0) {
    uint8_t mode = atoi(buff);
    if (mode==0) {
      board_wbDown();
      result = true;
    }
    if (mode==1) {
      board_wbUp();
      result = true;
    }
    if (mode==2) {
      board_wbStop();
      result = true;
    }
  }
  
  len=httpdFindArg(connData->post->buff, "cmd", buff, sizeof(buff));
  if (len<=0) len=httpdFindArg(connData->getArgs, "cmd", buff, sizeof(buff));
  if (len>0) {
    char buff[128];
    if (result) {
      os_sprintf(buff, "OK");
    } else {
      os_sprintf(buff, "ERROR");
    }
    httpdSend(connData, buff, strlen(buff));
  } else {
    httpdRedirect(connData, "home");
  }
  return HTTPD_CGI_DONE;
}

int ICACHE_FLASH_ATTR cgiSensor(HttpdConnData *connData)
{
  int len;
  bool result = false;
  char buff[1024];
  if (connData->conn==NULL) return HTTPD_CGI_DONE;
  len=httpdFindArg(connData->post->buff, "t", buff, sizeof(buff));
      
  if (len<=0) len=httpdFindArg(connData->getArgs, "temperature", buff, sizeof(buff));
  if (len>0) {
    updateSensorStrings();
    os_sprintf(buff, "%s", temperatureString);
    httpdSend(connData, buff, strlen(buff));
  }
  
  if (len<=0) len=httpdFindArg(connData->getArgs, "pressure", buff, sizeof(buff));
  if (len>0) {
    updateSensorStrings();
    os_sprintf(buff, "%s", pressureString);
    httpdSend(connData, buff, strlen(buff));
  }
  
  return HTTPD_CGI_DONE;
}
